; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph0 - mode
	thermograph2 - mode
	image1 - mode
	GroundStation3 - direction
	Star7 - direction
	Star2 - direction
	GroundStation0 - direction
	Star9 - direction
	Star6 - direction
	GroundStation8 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star5 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star6)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph2)
	(supports instrument3 image1)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 Star9)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation8)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet15)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation8)
	(supports instrument6 image1)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
)
(:goal (and
	(pointing satellite1 Star7)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 thermograph2)
	(have_image Planet14 thermograph2)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 thermograph2)
))

)

; plan
1. (turn_to satellite3 groundstation8 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 groundstation8)
   goals met: 0 of 8
2. (switch_on instrument5 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument5)
   goals met: 0 of 8
3. (calibrate satellite3 instrument5 groundstation8)
   added: (calibrated instrument5)
   goals met: 0 of 8
4. (turn_to satellite3 phenomenon13 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 phenomenon13)
   goals met: 0 of 8
5. (take_image satellite3 phenomenon13 instrument5 thermograph2)
   added: (have_image phenomenon13 thermograph2)
   goals met: 1 of 8
6. (turn_to satellite3 phenomenon12 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 phenomenon12)
   goals met: 1 of 8
7. (take_image satellite3 phenomenon12 instrument5 image1)
   added: (have_image phenomenon12 image1)
   goals met: 2 of 8
8. (turn_to satellite3 phenomenon11 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon11)
   goals met: 2 of 8
9. (turn_to satellite1 star7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star7)
   goals met: 3 of 8
10. (take_image satellite3 phenomenon11 instrument5 image1)
   added: (have_image phenomenon11 image1)
   goals met: 4 of 8
11. (turn_to satellite3 phenomenon16 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon16)
   goals met: 4 of 8
12. (take_image satellite3 phenomenon16 instrument5 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 5 of 8
13. (turn_to satellite3 planet14 phenomenon16)
   deleted: (pointing satellite3 phenomenon16)
   added: (pointing satellite3 planet14)
   goals met: 5 of 8
14. (take_image satellite3 planet14 instrument5 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 6 of 8
15. (turn_to satellite3 planet15 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet15)
   goals met: 6 of 8
16. (take_image satellite3 planet15 instrument5 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 7 of 8
17. (turn_to satellite3 star10 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 star10)
   goals met: 7 of 8
18. (take_image satellite3 star10 instrument5 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 8 of 8
